{"keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "output_dim": 10, "batch_input_shape": [null, 2], "activity_regularizer": null, "embeddings_regularizer": null, "input_length": 2, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "dtype": "float32", "input_dim": 276, "embeddings_constraint": null, "trainable": true, "name": "embedding_1"}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "return_sequences": false, "recurrent_dropout": 0.0, "kernel_constraint": null, "use_bias": true, "recurrent_constraint": null, "name": "lstm_1", "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "activity_regularizer": null, "stateful": false, "activation": "tanh", "return_state": false, "unit_forget_bias": true, "units": 50, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "trainable": true, "units": 276}}]}