{"config": [{"config": {"embeddings_regularizer": null, "name": "embedding_1", "input_length": 2, "embeddings_constraint": null, "output_dim": 10, "dtype": "float32", "activity_regularizer": null, "trainable": true, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "input_dim": 7100, "batch_input_shape": [null, 2]}, "class_name": "Embedding"}, {"config": {"bias_regularizer": null, "name": "lstm_1", "kernel_regularizer": null, "recurrent_dropout": 0.0, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 50, "activation": "tanh", "stateful": false, "return_state": false, "activity_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "bias_constraint": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "use_bias": true, "unroll": false}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 7100, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "softmax", "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2"}